darren1713/elua/src/platform/stm32l4/HALplatform.c
  GPIO_InitStructure.Pin = GPIO_PIN_3 | GPIO_PIN_4;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  GPIO_InitStructure.Pin = GPIO_PIN_14;
  GPIO_InitStructure.Pull = GPIO_PULLDOWN;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

#endif

#ifdef ENABLE_TRACE
  //Mapping TRACE pins, PE2,3,4,5,6
  GPIO_InitStructure.Pin = GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6;
  GPIO_Init(GPIOE, &GPIO_InitStructure);

  GPIO_PINAFConfig(GPIOE, GPIO_PIN_2, GPIO_AF_TRACE);
  GPIO_PINAFConfig(GPIOE, GPIO_PIN_3, GPIO_AF_TRACE);
  GPIO_PINAFConfig(GPIOE, GPIO_PIN_4, GPIO_AF_TRACE);
  GPIO_PINAFConfig(GPIOE, GPIO_PIN_5, GPIO_AF_TRACE);
  GPIO_PINAFConfig(GPIOE, GPIO_PIN_6, GPIO_AF_TRACE);
#endif

}

pio_type platform_pio_op( unsigned port, pio_type pinmask, int op )
{
  pio_type retval = 1;
  GPIO_InitTypeDef GPIO_InitStructure;
  GPIO_TypeDef * base = pio_port[ port ];

  switch( op )
  {
    case PLATFORM_IO_PORT_SET_VALUE:
      GPIO_Write(base, pinmask);
      break;

    case PLATFORM_IO_PIN_SET:
      GPIO_SetBits(base, pinmask);
      break;

    case PLATFORM_IO_PIN_CLEAR:
      GPIO_ResetBits(base, pinmask);
      break;

    case PLATFORM_IO_PORT_DIR_INPUT:
      pinmask = GPIO_PIN_All;
    case PLATFORM_IO_PIN_DIR_INPUT:
      GPIO_StructInit(&GPIO_InitStructure);
      GPIO_InitStructure.Pin  = pinmask;
      GPIO_InitStructure.Mode = GPIO_Mode_IN;

      GPIO_Init(base, &GPIO_InitStructure);
      break;

    case PLATFORM_IO_PORT_DIR_OUTPUT:
      pinmask = GPIO_PIN_All;
    case PLATFORM_IO_PIN_DIR_OUTPUT:
      GPIO_StructInit(&GPIO_InitStructure);
      GPIO_InitStructure.Pin   = pinmask;
      GPIO_InitStructure.Mode  = GPIO_Mode_OUT;
      GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_MEDIUM;

      GPIO_Init(base, &GPIO_InitStructure);
      break;

    case PLATFORM_IO_PORT_GET_VALUE:
      retval = pinmask == PLATFORM_IO_READ_IN_MASK ? GPIO_ReadInputData(base) : GPIO_ReadOutputData(base);
      break;

    case PLATFORM_IO_PIN_GET:
      retval = GPIO_ReadInputDataBit(base, pinmask);
      break;

    case PLATFORM_IO_PIN_PULLUP:
      GPIO_StructInit(&GPIO_InitStructure);
      GPIO_InitStructure.Pin   = pinmask;
      GPIO_InitStructure.Pull = GPIO_PULLUP;

      GPIO_Init(base, &GPIO_InitStructure);
      break;

    case PLATFORM_IO_PIN_PULLDOWN:
      GPIO_StructInit(&GPIO_InitStructure);
      GPIO_InitStructure.Pin   = pinmask;
      GPIO_InitStructure.Pull  = GPIO_PULLDOWN;

      GPIO_Init(base, &GPIO_InitStructure);
      break;

    case PLATFORM_IO_PIN_NOPULL:
      GPIO_StructInit(&GPIO_InitStructure);
      GPIO_InitStructure.Pin   = pinmask;
      GPIO_InitStructure.Pull  = GPIO_NOPULL;

      GPIO_Init(base, &GPIO_InitStructure);
      break;

    default:
      retval = 0;
      break;
  }
  return retval;
}

// ****************************************************************************
// SPI
// NOTE: Only configuring 2 SPI peripherals, since the third one shares pins with JTAG

static SPI_TypeDef *const spi[]  = { SPI1, SPI2, SPI3 };
static const u8 spi_AF[]  = { GPIO_AF_SPI1, GPIO_AF_SPI2, GPIO_AF_SPI3 };

static const u16 spi_prescaler[] = { SPI_BaudRatePrescaler_2, SPI_BaudRatePrescaler_4, SPI_BaudRatePrescaler_8,
                                     SPI_BaudRatePrescaler_16, SPI_BaudRatePrescaler_32, SPI_BaudRatePrescaler_64,
                                     SPI_BaudRatePrescaler_128, SPI_BaudRatePrescaler_256 };

static const u8 spi_GPIO_PINs_source[][3] = {
  //SCK,    MISO,   MOSI
  {GPIO_PIN_5  , GPIO_PIN_6  , GPIO_PIN_7},
  {GPIO_PIN_13 , GPIO_PIN_14 , GPIO_PIN_15},
  {GPIO_PIN_10 , GPIO_PIN_11 , GPIO_PIN_12}
};

static const u16 spi_GPIO_PINs[] = { GPIO_PIN_5  | GPIO_PIN_6  | GPIO_PIN_7,
                                     GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15,
                                     GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12,
                                   };
//                                   SCK           MISO          MOSI
static GPIO_TypeDef *const spi_gpio_port[] = { GPIOA, GPIOB, GPIOC };

static void spis_init()
{
  // Enable Clocks
  __HAL_RCC_SPI1_CLK_ENABLE();
  __HAL_RCC_SPI2_CLK_ENABLE();
  __HAL_RCC_SPI3_CLK_ENABLE();
}

#define SPI_GET_BASE_CLK( id ) ( ( id ) == 0 ? ( HCLK / PCLK2_DIV ) : ( HCLK / PCLK1_DIV ) )

u32 platform_spi_setup( unsigned id, int mode, u32 clock, unsigned cpol, unsigned cpha, unsigned databits )
{
  SPI_InitTypeDef SPI_InitStructure;
  GPIO_InitTypeDef GPIO_InitStructure;
  u8 prescaler_idx = intlog2( ( unsigned ) ( SPI_GET_BASE_CLK( id ) / clock ) );
  int i;

  if ( prescaler_idx < 0 )
    prescaler_idx = 0;
  if ( prescaler_idx > 7 )
    prescaler_idx = 7;

  //Connect pin to SPI
  for(i = 0; i < 3; i++)
  {
    GPIO_PINAFConfig(spi_gpio_port[id], spi_GPIO_PINs_source[id][i], spi_AF[id]);
  }

  /* Configure SPI pins */
  GPIO_InitStructure.Pin = spi_GPIO_PINs[ id ];
  GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_MEDIUM;
  GPIO_InitStructure.Mode = GPIO_MODE_AF_OD;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.Pull = GPIO_PULLUP; //pull-up or pull-down
  GPIO_Init(spi_gpio_port[ id ], &GPIO_InitStructure);

  SPI_I2S_DeInit(spi[ id ]);

  /* Take down, then reconfigure SPI peripheral */
  SPI_Cmd( spi[ id ], DISABLE );
  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
  SPI_InitStructure.SPI_Mode = mode ? SPI_Mode_Master : SPI_Mode_Slave;
  SPI_InitStructure.SPI_DataSize = ( databits == 16 ) ? SPI_DataSize_16b : SPI_DataSize_8b; // not ideal, but defaults to sane 8-bits
  SPI_InitStructure.SPI_CPOL = cpol ? SPI_CPOL_High : SPI_CPOL_Low;
  SPI_InitStructure.SPI_CPHA = cpha ? SPI_CPHA_2Edge : SPI_CPHA_1Edge;
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
  SPI_InitStructure.SPI_BaudRatePrescaler = spi_prescaler[ prescaler_idx ];
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 7;
  SPI_Init( spi[ id ], &SPI_InitStructure );
  SPI_Cmd( spi[ id ], ENABLE );

  return ( SPI_GET_BASE_CLK( id ) / ( ( ( u16 )2 << ( prescaler_idx ) ) ) );
}

spi_data_type platform_spi_send_recv( unsigned id, spi_data_type data )
{
  SPI_I2S_SendData( spi[ id ], data );

  while ( SPI_I2S_GetFlagStatus( spi[ id ], SPI_I2S_FLAG_RXNE ) == RESET );

  return SPI_I2S_ReceiveData( spi[ id ] );
}

