darren1713/elua/src/platform/stm32l4/HALplatform.c
void platform_spi_select( unsigned id, int is_select )
{
  // This platform doesn't have a hardware SS pin, so there's nothing to do here
  id = id;
  is_select = is_select;
}


// ****************************************************************************
// UART
// TODO: Support timeouts.

// All possible STM32 uarts defs
USART_TypeDef *const stm32_usart[] =          { USART1, USART2, USART3, UART4, UART5, USART6};
const u8 stm32_usart_AF[] =       { GPIO_AF7_USART1, GPIO_AF7_USART2, GPIO_AF7_USART3, GPIO_AF8_UART4, GPIO_AF8_UART5, GPIO_AF8_LPUART1};
//#if defined( ELUA_BOARD_STM32L4ALT )
  static GPIO_TypeDef *const usart_gpio_rx_port[] = { GPIOA, GPIOA, GPIOC, GPIOC, GPIOD };
  static GPIO_TypeDef *const usart_gpio_tx_port[] = { GPIOA, GPIOA, GPIOC, GPIOC, GPIOD };
  static const u16 usart_gpio_rx_pin[] = { GPIO_PIN_10, GPIO_PIN_3, GPIO_PIN_11, GPIO_PIN_11, GPIO_PIN_2 };
  static const u8 usart_gpio_rx_pin_source[] = { GPIO_PIN_10, GPIO_PIN_3, GPIO_PIN_11, GPIO_PIN_11, GPIO_PIN_2 };
  static const u16 usart_gpio_tx_pin[] = { GPIO_PIN_9, GPIO_PIN_2, GPIO_PIN_10, GPIO_PIN_10, GPIO_PIN_12 };
  static const u8 usart_gpio_tx_pin_source[] = { GPIO_PIN_9, GPIO_PIN_2, GPIO_PIN_10, GPIO_PIN_10, GPIO_PIN_12 };
//#else
//  static GPIO_TypeDef *const usart_gpio_rx_port[] = { GPIOB, GPIOA, GPIOC, GPIOC, GPIOD };
//  static GPIO_TypeDef *const usart_gpio_tx_port[] = { GPIOB, GPIOA, GPIOC, GPIOC, GPIOD };
//  static const u16 usart_gpio_rx_pin[] = { GPIO_PIN_7, GPIO_PIN_3, GPIO_PIN_11, GPIO_PIN_11, GPIO_PIN_2 };
//  static const u8 usart_gpio_rx_pin_source[] = { GPIO_PIN_7, GPIO_PIN_3, GPIO_PIN_11, GPIO_PIN_11, GPIO_PIN_2 };
//  static const u16 usart_gpio_tx_pin[] = { GPIO_PIN_6, GPIO_PIN_2, GPIO_PIN_10, GPIO_PIN_10, GPIO_PIN_12 };
//  static const u8 usart_gpio_tx_pin_source[] = { GPIO_PIN_6, GPIO_PIN_2, GPIO_PIN_10, GPIO_PIN_10, GPIO_PIN_12 };
//#endif

static GPIO_TypeDef *const usart_gpio_hwflow_port[] = { GPIOA, GPIOA, GPIOB };
static const u16 usart_gpio_cts_pin[] = { GPIO_PIN_11, GPIO_PIN_0, GPIO_PIN_13 };
static const u16 usart_gpio_rts_pin[] = { GPIO_PIN_12, GPIO_PIN_1, GPIO_PIN_14 };

static void usart_init(u32 id, USART_InitTypeDef * initVals)
{
  /* Configure USART IO */
  GPIO_InitTypeDef GPIO_InitStructure;
  GPIO_TypeDef* prxport = usart_gpio_rx_port[ id ];
  GPIO_TypeDef* ptxport = usart_gpio_tx_port[ id ];
  u16 gpio_rx_pin = usart_gpio_rx_pin[ id ];
  u16 gpio_tx_pin = usart_gpio_tx_pin[ id ];
  u8 gpio_rx_pinsource = usart_gpio_rx_pin_source[ id ];
  u8 gpio_tx_pinsource = usart_gpio_tx_pin_source[ id ];

  // Overwrite console UART configuration with the parameters from the configuration file
  if( id == CON_UART_ID )
  {
    prxport = CON_GPIO_PORT_MACRO( STM32L4_CON_RX_PORT );
    ptxport = CON_GPIO_PORT_MACRO( STM32L4_CON_TX_PORT );
    gpio_rx_pin = CON_GPIO_PIN_MACRO( STM32L4_CON_RX_PIN );
    gpio_tx_pin = CON_GPIO_PIN_MACRO( STM32L4_CON_TX_PIN );
    gpio_rx_pinsource = CON_GPIO_SOURCE_MACRO( STM32L4_CON_RX_PIN );
    gpio_tx_pinsource = CON_GPIO_SOURCE_MACRO( STM32L4_CON_TX_PIN );
  }

  //Connect pin to USARTx_Tx
  GPIO_PINAFConfig(ptxport, gpio_tx_pinsource, stm32_usart_AF[id]);
  //Connect pin to USARTx_Rx
  GPIO_PINAFConfig(prxport, gpio_rx_pinsource, stm32_usart_AF[id]);

  /* Configure USART Tx Pin as alternate function push-pull */
  GPIO_InitStructure.Pin = gpio_tx_pin;
  GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_MEDIUM;
  GPIO_InitStructure.Mode = GPIO_MODE_AF_OD;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP; //push pull or open drain
  GPIO_InitStructure.Pull = GPIO_PULLUP; //pull-up or pull-down
  GPIO_Init(ptxport, &GPIO_InitStructure);

  /* Configure USART Rx Pin as input floating */
  GPIO_InitStructure.Pin = gpio_rx_pin;
  GPIO_InitStructure.Pull = GPIO_PULLUP; //pull-up or pull-down
  GPIO_Init(prxport, &GPIO_InitStructure);

  USART_DeInit(stm32_usart[id]);

  /* Configure USART */
  USART_Init(stm32_usart[id], initVals);

  /* Enable USART */
  __HAL_USART_ENABLE(stm32_usart[id]);
}

static void uarts_init()
{
  // Enable clocks.
  __HAL_RCC_USART1_CLK_ENABLE();
  __HAL_RCC_USART2_CLK_ENABLE();
  __HAL_RCC_USART3_CLK_ENABLE();
  __HAL_RCC_UART4_CLK_ENABLE();
  __HAL_RCC_UART5_CLK_ENABLE();
  __HAL_RCC_LPUART1_CLK_ENABLE();
}

u32 platform_uart_setup( unsigned id, u32 baud, int databits, int parity, int stopbits )
{
  USART_InitTypeDef USART_InitStructure;

  if( id == CDC_UART_ID ) // no dynamic configuration yet
    return 0;

  USART_InitStructure.BaudRate = baud;
//  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.Mode = USART_MODE_TX_RX;

  switch( databits )
  {
    case 5:
    case 6:
    case 7:
    case 8:
      USART_InitStructure.WordLength = USART_WORDLENGTH_8B;
      break;
    case 9:
      USART_InitStructure.WordLength = USART_WORDLENGTH_9B;
      break;
    default:
      USART_InitStructure.WordLength = USART_WORDLENGTH_8B;
      break;
  }

  switch (stopbits)
  {
    case PLATFORM_UART_STOPBITS_1:
      USART_InitStructure.StopBits = USART_STOPBITS_1;
      break;
    case PLATFORM_UART_STOPBITS_2:
      USART_InitStructure.StopBits = USART_STOPBITS_2;
      break;
    default:
      USART_InitStructure.StopBits = USART_STOPBITS_1;
      break;
  }

  switch (parity)
  {
    case PLATFORM_UART_PARITY_EVEN:
      USART_InitStructure.Parity = USART_PARITY_EVEN;
      break;
    case PLATFORM_UART_PARITY_ODD:
      USART_InitStructure.Parity = USART_PARITY_ODD;
      break;
    default:
      USART_InitStructure.Parity = USART_PARITY_NONE;
      break;
  }

  usart_init(id, &USART_InitStructure);

  return baud;
}

extern uint16_t VCP_DataTx(uint8_t* Buf, uint32_t Len);
void platform_s_uart_send( unsigned id, u8 data )
{
#ifdef BUILD_USB_CDC
  if( id == CDC_UART_ID )
    VCP_DataTx( &data, 1 );
  else
#endif  
  {
    while(__HAL_USART_GET_FLAG(stm32_usart[id], USART_FLAG_TXE) == RESET);
    USART_SendData(stm32_usart[id], data);
  }
}

int platform_s_uart_recv( unsigned id, timer_data_type timeout )
{
  if( id == CDC_UART_ID ) // this shouldn't happen
    return -1;
  if( timeout == 0 )
  {
    if (__HAL_USART_GET_FLAG(stm32_usart[id], USART_FLAG_RXNE) == RESET)
      return -1;
    else
      return USART_ReceiveData(stm32_usart[id]);
  }
  // Receive char blocking
  while(__HAL_USART_GET_FLAG(stm32_usart[id], USART_FLAG_RXNE) == RESET);
  return USART_ReceiveData(stm32_usart[id]);
}

