darren1713/elua/src/platform/stm32l4/HALplatform.c
  TIM_OC1PreloadConfig( base, TIM_OCPreload_Enable );

  stm32_timer_int_periodic_flag[ id ] = type;

  TIM_SetCounter( base, 0 );
  TIM_Cmd( base, ENABLE );
  //TIM_ITConfig( base, TIM_IT_CC1, ENABLE );

  return PLATFORM_TIMER_INT_OK;
}

u64 platform_timer_sys_raw_read()
{
  return SysTick->LOAD - SysTick->VAL;
}

void platform_timer_sys_disable_int()
{
  SysTick->CTRL &= ~( 1 << SysTick_CTRL_TICKINT_Pos );
}

void platform_timer_sys_enable_int()
{
  SysTick->CTRL |= 1 << SysTick_CTRL_TICKINT_Pos;
}

timer_data_type platform_timer_read_sys()
{
  return cmn_systimer_get();
}

// ****************************************************************************
// CAN
// TODO: Many things
#if (NUM_CAN > 0)

CAN_TypeDef *const stm32_can[] =             { CAN1,                CAN2 };
const u8 stm32_can_AF[] =                    { GPIO_AF_CAN1,        GPIO_AF_CAN2 };
static const u32 can_clock[] =               { RCC_APB1Periph_CAN1, RCC_APB1Periph_CAN2 };

#if defined( ELUA_BOARD_STM32F4_CAN_PIN_CONFIG_1 )

static GPIO_TypeDef *const can_gpio_port[] = { GPIOD,               GPIOB };
static const u16 can_gpio_rx_pin[] =         { GPIO_PIN_0,          GPIO_PIN_12 };
static const u8 can_gpio_rx_pin_source[] =   { GPIO_PIN_0,     GPIO_PIN_12 };
static const u16 can_gpio_tx_pin[] =         { GPIO_PIN_1,          GPIO_PIN_13 };
static const u8 can_gpio_tx_pin_source[] =   { GPIO_PIN_1,     GPIO_PIN_13 };

#elif defined( ELUA_BOARD_STM32F4_CAN_PIN_CONFIG_2 )

static GPIO_TypeDef *const can_gpio_port[] = { GPIOD,               GPIOB };
static const u16 can_gpio_rx_pin[] =         { GPIO_PIN_0,          GPIO_PIN_5 };
static const u8 can_gpio_rx_pin_source[] =   { GPIO_PIN_0,     GPIO_PIN_5 };
static const u16 can_gpio_tx_pin[] =         { GPIO_PIN_1,          GPIO_PIN_6 };
static const u8 can_gpio_tx_pin_source[] =   { GPIO_PIN_1,     GPIO_PIN_6 };

#elif defined( ELUA_BOARD_STM32F4_CAN_PIN_CONFIG_3 )

static GPIO_TypeDef *const can_gpio_port[] = { GPIOB,               GPIOB };
static const u16 can_gpio_rx_pin[] =         { GPIO_PIN_8,          GPIO_PIN_12 };
static const u8 can_gpio_rx_pin_source[] =   { GPIO_PIN_8,     GPIO_PIN_12 };
static const u16 can_gpio_tx_pin[] =         { GPIO_PIN_9,          GPIO_PIN_13 };
static const u8 can_gpio_tx_pin_source[] =   { GPIO_PIN_9,     GPIO_PIN_13 };

#elif defined( ELUA_BOARD_STM32F4_CAN_PIN_CONFIG_4 )

static GPIO_TypeDef *const can_gpio_port[] = { GPIOB,               GPIOB };
static const u16 can_gpio_rx_pin[] =         { GPIO_PIN_8,          GPIO_PIN_5 };
static const u8 can_gpio_rx_pin_source[] =   { GPIO_PIN_8,     GPIO_PIN_5 };
static const u16 can_gpio_tx_pin[] =         { GPIO_PIN_9,          GPIO_PIN_6 };
static const u8 can_gpio_tx_pin_source[] =   { GPIO_PIN_9,     GPIO_PIN_6 };

#elif defined( ELUA_BOARD_STM32F4ALT ) || defined( ELUA_BOARD_STM32_E407 )

static GPIO_TypeDef *const can_gpio_port[] = { GPIOB,               GPIOB };
static const u16 can_gpio_rx_pin[] =         { GPIO_PIN_8,          GPIO_PIN_12 };
static const u8 can_gpio_rx_pin_source[] =   { GPIO_PIN_8,     GPIO_PIN_12 };
static const u16 can_gpio_tx_pin[] =         { GPIO_PIN_9,          GPIO_PIN_13 };
static const u8 can_gpio_tx_pin_source[] =   { GPIO_PIN_9,     GPIO_PIN_13 };

#else

static GPIO_TypeDef *const can_gpio_port[] = { GPIOD,               GPIOB };
static const u16 can_gpio_rx_pin[] =         { GPIO_PIN_0,          GPIO_PIN_12 };
static const u8 can_gpio_rx_pin_source[] =   { GPIO_PIN_0,     GPIO_PIN_12 };
static const u16 can_gpio_tx_pin[] =         { GPIO_PIN_1,          GPIO_PIN_13 };
static const u8 can_gpio_tx_pin_source[] =   { GPIO_PIN_1,     GPIO_PIN_13 };

#endif

void cans_init( void )
{
  // CAN Periph clock enable
  __HAL_RCC_CAN1_CLK_ENABLE();
}


#if ELUA_BOARD_CPU_CLOCK_HZ == 168000000

/*       BS1 BS2 SJW Pre
1M:      12  8   1   2
500k:    8   5   1   6
250k:    8   5   1   12
125k:    12  8   1   16
100k:    12  8   1   20 */

#define CAN_BAUD_COUNT 5
static const u8 can_baud_bs1[]    = { CAN_BS1_12tq, CAN_BS1_12tq, CAN_BS1_8tq, CAN_BS1_8tq, CAN_BS1_12tq };
static const u8 can_baud_bs2[]    = { CAN_BS1_8tq,  CAN_BS1_8tq,  CAN_BS1_5tq, CAN_BS1_5tq, CAN_BS1_8tq };
static const u8 can_baud_sjw[]    = { CAN_SJW_1tq,  CAN_SJW_1tq,  CAN_SJW_1tq, CAN_SJW_1tq, CAN_SJW_1tq };
static const u8 can_baud_pre[]    = { 20, 16, 12, 6, 2 };

#endif

#if ELUA_BOARD_CPU_CLOCK_HZ == 120000000

/*       BS1 BS2 SJW Pre
1M:      6   3   1   3
500k:    12  7   1   3
250k:    12  7   1   6
125k:    12  7   1   12
100k:    12  7   1   15 */

#define CAN_BAUD_COUNT 5
static const u8 can_baud_bs1[]    = { CAN_BS1_12tq, CAN_BS1_12tq, CAN_BS1_12tq, CAN_BS1_12tq, CAN_BS1_6tq };
static const u8 can_baud_bs2[]    = { CAN_BS1_7tq,  CAN_BS1_7tq,  CAN_BS1_7tq, CAN_BS1_7tq, CAN_BS1_3tq };
static const u8 can_baud_sjw[]    = { CAN_SJW_1tq,  CAN_SJW_1tq,  CAN_SJW_1tq, CAN_SJW_1tq, CAN_SJW_1tq };
static const u8 can_baud_pre[]    = { 15, 12, 6, 3, 3 };

#endif

#if ELUA_BOARD_CPU_CLOCK_HZ == 96000000

/*       BS1 BS2 SJW Pre
1M:      4   3   1   3
500k:    9   6   1   3
250k:    9   6   1   6
125k:    9   6   1   12
100k:    9   6   1   15 */

#define CAN_BAUD_COUNT 5
static const u8 can_baud_bs1[]    = { CAN_BS1_9tq, CAN_BS1_9tq, CAN_BS1_9tq, CAN_BS1_9tq, CAN_BS1_4tq };
static const u8 can_baud_bs2[]    = { CAN_BS1_6tq,  CAN_BS1_6tq,  CAN_BS1_6tq, CAN_BS1_6tq, CAN_BS1_3tq };
static const u8 can_baud_sjw[]    = { CAN_SJW_1tq,  CAN_SJW_1tq,  CAN_SJW_1tq, CAN_SJW_1tq, CAN_SJW_1tq };
static const u8 can_baud_pre[]    = { 15, 12, 6, 3, 3 };

#endif

#if ELUA_BOARD_CPU_CLOCK_HZ == 84000000

/*       BS1 BS2 SJW Pre
1M:      13   7   1   1
500k:    13   7   1   2
250k:     7   4   1   7
125k:    15   8   1   7
100k:    13   7   1  10 */

#define CAN_BAUD_COUNT 5
static const u8 can_baud_bs1[]    = { CAN_BS1_13tq, CAN_BS1_15tq, CAN_BS1_7tq, CAN_BS1_13tq, CAN_BS1_13tq };
static const u8 can_baud_bs2[]    = { CAN_BS1_7tq,  CAN_BS1_8tq,  CAN_BS1_4tq, CAN_BS1_7tq,  CAN_BS1_7tq };
static const u8 can_baud_sjw[]    = { CAN_SJW_1tq,  CAN_SJW_1tq,  CAN_SJW_1tq, CAN_SJW_1tq,  CAN_SJW_1tq };
static const u8 can_baud_pre[]    = { 10, 7, 7, 2, 1 };

#endif

